Repository: moaiy-com/moaiy
Catalog: Moaiy/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, ja, ko, pt_br, ru, zh_hans

# history_empty_description
source: Your encryption and decryption operations will appear here
ar: ستظهر هنا عمليات التشفير وفك التشفير
de: Ihre Verschlüsselungs- und Entschlüsselungsvorgänge werden hier angezeigt
es: Tus operaciones de cifrado y descifrado aparecerán aquí
fr: Vos opérations de cryptage et de décryptage apparaîtront ici
hi: आपके एन्क्रिप्शन और डिक्रिप्शन ऑपरेशन यहां दिखाई देंगे
ja: 暗号化と復号化の操作がここに表示されます
ko: 암호화 및 복호화 작업이 여기에 표시됩니다.
pt_br: Suas operações de criptografia e descriptografia aparecerão aqui
ru: Здесь будут отображаться ваши операции шифрования и дешифрования.
zh_hans: 您的加密和解密操作将显示在这里

# history_empty_title
source: No History
ar: لا يوجد تاريخ
de: Keine Geschichte
es: Sin historia
fr: Pas d'historique
hi: कोई इतिहास नहीं
ja: 履歴なし
ko: 기록 없음
pt_br: Sem histórico
ru: Нет истории
zh_hans: 暂无历史记录

# history_title
source: Operation History
ar: تاريخ العملية
de: Operationsverlauf
es: Historial de operaciones
fr: Historique des opérations
hi: ऑपरेशन इतिहास
ja: 運用履歴
ko: 운영 내역
pt_br: Histórico de operações
ru: История эксплуатации
zh_hans: 操作历史

# how_to_select_topic
source: Select a topic to get started
ar: حدد موضوعًا للبدء
de: Wählen Sie ein Thema aus, um zu beginnen
es: Seleccione un tema para comenzar
fr: Sélectionnez un sujet pour commencer
hi: आरंभ करने के लिए एक विषय चुनें
ja: 始めるにはトピックを選択してください
ko: 시작하려면 주제를 선택하세요.
pt_br: Selecione um tópico para começar
ru: Выберите тему, чтобы начать
zh_hans: 请选择一个主题开始

# how_to_title
source: How To
ar: كيف
de: So geht's
es: Cómo
fr: Comment
hi: कैसे करें
ja: ハウツー
ko: 방법
pt_br: Como fazer
ru: Как
zh_hans: 使用指南

# import_alert_title_failure
source: Import Not Successful
ar: الاستيراد غير ناجح
de: Import nicht erfolgreich
es: Importación fallida
fr: L'importation n'a pas réussi
hi: आयात सफल नहीं
ja: インポートに失敗しました
ko: 가져오기 실패
pt_br: Importação sem sucesso
ru: Импорт не удался
zh_hans: 导入未成功

# import_file_picker_message
source: Select a GPG key file to import
ar: حدد ملف مفتاح GPG لاستيراده
de: Wählen Sie eine GPG-Schlüsseldatei zum Importieren aus
es: Seleccione un archivo de clave GPG para importar
fr: Sélectionnez un fichier de clé GPG à importer
hi: आयात करने के लिए GPG कुंजी फ़ाइल का चयन करें
ja: インポートする GPG キー ファイルを選択してください
ko: 가져올 GPG 키 파일을 선택하세요.
pt_br: Selecione um arquivo de chave GPG para importar
ru: Выберите файл ключа GPG для импорта.
zh_hans: 选择要导入的 GPG 密钥文件

source: Import from Keyserver
ar: استيراد من خادم المفاتيح
de: Vom Schlüsselserver importieren
es: Importar desde servidor de claves
fr: Importer depuis le serveur de clés
hi: कीसर्वर से आयात करें
ja: キーサーバーからインポート
ko: 키서버에서 가져오기
pt_br: Importar do servidor de chaves
ru: Импорт с сервера ключей
zh_hans: 从 Keyserver 导入

# import_from_yubikey
source: YubiKey
ar: يوبيكي
fr: Clé Yubi
hi: यूबीकी
ja: ユビキー
ko: 유비키
ru: ЮбиКей

# import_key_description
source: Select or drop a GPG key file to import
ar: حدد أو أسقط ملف مفتاح GPG لاستيراده
de: Wählen Sie eine GPG-Schlüsseldatei zum Importieren aus oder legen Sie sie ab
es: Seleccione o suelte un archivo de clave GPG para importar
fr: Sélectionnez ou déposez un fichier de clé GPG à importer
hi: आयात करने के लिए GPG कुंजी फ़ाइल चुनें या छोड़ें
ja: インポートする GPG キー ファイルを選択またはドロップします
ko: 가져올 GPG 키 파일을 선택하거나 삭제하세요.
pt_br: Selecione ou solte um arquivo de chave GPG para importar
ru: Выберите или перетащите файл ключей GPG для импорта.
zh_hans: 选择或拖放 GPG 密钥文件进行导入

# import_keyserver_empty_query
source: Please enter a key URL, fingerprint, key ID, or email.
ar: الرجاء إدخال عنوان URL الرئيسي أو بصمة الإصبع أو معرف المفتاح أو البريد الإلكتروني.
de: Bitte geben Sie eine Schlüssel-URL, einen Fingerabdruck, eine Schlüssel-ID oder eine E-Mail-Adresse ein.
es: Ingrese una URL clave, huella digital, ID de clave o correo electrónico.
fr: Veuillez saisir une URL de clé, une empreinte digitale, un identifiant de clé ou un e-mail.
hi: कृपया एक कुंजी यूआरएल, फ़िंगरप्रिंट, कुंजी आईडी, या ईमेल दर्ज करें।
ja: キーの URL、指紋、キー ID、または電子メールを入力してください。
ko: 키 URL, 지문, 키 ID 또는 이메일을 입력하세요.
pt_br: Insira um URL de chave, impressão digital, ID de chave ou e-mail.
ru: Введите URL-адрес ключа, отпечаток пальца, идентификатор ключа или адрес электронной почты.
zh_hans: 请输入密钥 URL、指纹、Key ID 或邮箱。

# import_keyserver_invalid_query
source: Unable to parse input. Use a key URL, fingerprint, key ID, or email.
ar: غير قادر على تحليل الإدخال. استخدم عنوان URL الرئيسي أو بصمة الإصبع أو معرف المفتاح أو البريد الإلكتروني.
de: Eingabe kann nicht geparst werden. Verwenden Sie eine Schlüssel-URL, einen Fingerabdruck, eine Schlüssel-ID oder eine E-Mail.
es: No se puede analizar la entrada. Utilice una URL clave, huella digital, ID de clave o correo electrónico.
fr: Impossible d'analyser l'entrée. Utilisez une URL de clé, une empreinte digitale, un identifiant de clé ou un e-mail.
hi: इनपुट पार्स करने में असमर्थ. कुंजी यूआरएल, फ़िंगरप्रिंट, कुंजी आईडी या ईमेल का उपयोग करें।
ja: 入力を解析できません。キー URL、フィンガープリント、キー ID、または電子メールを使用します。
ko: 입력을 구문 분석할 수 없습니다. 키 URL, 지문, 키 ID 또는 이메일을 사용하세요.
pt_br: Não foi possível analisar a entrada. Use a key URL, fingerprint, key ID, or email.
ru: Невозможно проанализировать ввод. Используйте URL-адрес ключа, отпечаток пальца, идентификатор ключа или адрес электронной почты.
zh_hans: 无法解析输入，请使用密钥 URL、指纹、Key ID 或邮箱。

# import_keyserver_query_hint
source: Supports key URL, fingerprint, key ID, or email.
ar: يدعم عنوان URL الرئيسي أو بصمة الإصبع أو معرف المفتاح أو البريد الإلكتروني.
de: Unterstützt Schlüssel-URL, Fingerabdruck, Schlüssel-ID oder E-Mail.
es: Admite URL de clave, huella digital, ID de clave o correo electrónico.
fr: Prend en charge l'URL de la clé, l'empreinte digitale, l'ID de la clé ou l'e-mail.
hi: कुंजी यूआरएल, फ़िंगरप्रिंट, कुंजी आईडी या ईमेल का समर्थन करता है।
ja: キー URL、指紋、キー ID、または電子メールをサポートします。
ko: 키 URL, 지문, 키 ID 또는 이메일을 지원합니다.
pt_br: Suporta URL de chave, impressão digital, ID de chave ou e-mail.
ru: Поддерживает URL-адрес ключа, отпечаток пальца, идентификатор ключа или адрес электронной почты.
zh_hans: 支持输入密钥 URL、指纹、Key ID 或邮箱。

# import_keyserver_query_placeholder
source: Paste key URL, fingerprint, key ID, or email
ar: قم بلصق عنوان URL الرئيسي أو بصمة الإصبع أو معرف المفتاح أو البريد الإلكتروني
de: Fügen Sie Schlüssel-URL, Fingerabdruck, Schlüssel-ID oder E-Mail ein
es: Pegue la URL de la clave, la huella digital, el ID de la clave o el correo electrónico
fr: Collez l'URL de la clé, l'empreinte digitale, l'ID de la clé ou l'e-mail
hi: कुंजी यूआरएल, फ़िंगरप्रिंट, कुंजी आईडी, या ईमेल चिपकाएँ
ja: キーの URL、指紋、キー ID、または電子メールを貼り付けます
ko: 키 URL, 지문, 키 ID 또는 이메일 붙여넣기
pt_br: Cole o URL da chave, impressão digital, ID da chave ou e-mail
ru: Вставьте URL-адрес ключа, отпечаток пальца, идентификатор ключа или адрес электронной почты.
zh_hans: 粘贴密钥 URL、指纹、Key ID 或邮箱

# import_mode_from_existing_keys
source: From Existing Keys
ar: من المفاتيح الموجودة
de: Aus vorhandenen Schlüsseln
es: De claves existentes
fr: À partir de clés existantes
hi: मौजूदा कुंजियों से
ja: 既存のキーから
ko: 기존 키에서
pt_br: Das chaves existentes
ru: Из существующих ключей
zh_hans: 从已有密钥

# import_mode_from_file
source: From File
ar: من الملف
de: Aus Datei
es: Desde archivo
fr: À partir du fichier
hi: लेख्यपत्र से
ja: ファイルから
ko: 파일에서
pt_br: Do arquivo
ru: Из файла
zh_hans: 从文件

# import_mode_from_keyserver
source: From Keyserver
ar: من خادم المفاتيح
de: Vom Keyserver
es: Desde el servidor de claves
fr: Depuis le serveur de clés
hi: कीसर्वर से
ja: キーサーバーから
ko: 키서버에서
pt_br: Do servidor de chaves
ru: С сервера ключей
zh_hans: 从 Keyserver

# import_mode_from_smartcard
source: From Smartcard
ar: من البطاقة الذكية
de: Von Smartcard
es: Desde tarjeta inteligente
fr: Depuis une carte à puce
hi: स्मार्टकार्ड से
ja: スマートカードから
ko: 스마트카드에서
pt_br: Do cartão inteligente
ru: Со смарт-карты
zh_hans: 从智能卡

# import_success_details
source: Imported: %lld, Unchanged: %lld
ar: مستورد: %lld، بدون تغيير: %lld
de: Importiert: %lld, Unverändert: %lld
es: Importado: %lld, sin cambios: %lld
fr: Importé : %lld, Inchangé : %lld
hi: आयातित: %lld, अपरिवर्तित: %lld
ja: インポート: %lld、変更なし: %lld
ko: 가져옴: %lld, 변경되지 않음: %lld
pt_br: Importado: %lld, Inalterado: %lld
ru: Импортировано: %lld, без изменений: %lld.
zh_hans: 已导入：%lld，未更改：%lld

# import_success_message
source: Key imported successfully
ar: تم استيراد المفتاح بنجاح
de: Schlüssel erfolgreich importiert
es: Clave importada exitosamente
fr: Clé importée avec succès
hi: कुंजी सफलतापूर्वक आयात की गई
ja: キーが正常にインポートされました
ko: 키를 성공적으로 가져왔습니다.
pt_br: Chave importada com sucesso
ru: Ключ успешно импортирован
zh_hans: 密钥导入成功

# info_use_import_menu
source: Use Import Key to add key files
ar: استخدم مفتاح الاستيراد لإضافة الملفات الرئيسية
de: Verwenden Sie „Schlüssel importieren“, um Schlüsseldateien hinzuzufügen
es: Utilice Importar clave para agregar archivos clave
fr: Utilisez Import Key pour ajouter des fichiers clés
hi: मुख्य फ़ाइलें जोड़ने के लिए आयात कुंजी का उपयोग करें
ja: インポートキーを使用してキーファイルを追加します
ko: 키 가져오기를 사용하여 키 파일 추가
pt_br: Use Import Key para adicionar arquivos principais
ru: Используйте Import Key для добавления файлов ключей.
zh_hans: 请使用“导入密钥”来添加密钥文件

# key_info
source: Key Information
ar: المعلومات الأساسية
de: Wichtige Informationen
es: Información clave
fr: Informations clés
hi: मुख्य जानकारी
ja: 重要な情報
ko: 주요정보
pt_br: Informações importantes
ru: Ключевая информация
zh_hans: 密钥信息

# key_list_alert_title_failure
source: Couldn't Load Keys
ar: تعذر تحميل المفاتيح
de: Schlüssel konnten nicht geladen werden
es: No se pudieron cargar las claves
fr: Impossible de charger les clés
hi: कुंजियाँ लोड नहीं हो सकीं
ja: キーをロードできませんでした
ko: 키를 로드할 수 없습니다.
pt_br: Não foi possível carregar as chaves
ru: Не удалось загрузить ключи
zh_hans: 无法加载密钥

# key_list_error_load_failed
source: We couldn't load your keys right now. Please try again.
ar: لم نتمكن من تحميل المفاتيح الخاصة بك الآن. يرجى المحاولة مرة أخرى.
de: Wir konnten Ihre Schlüssel momentan nicht laden. Bitte versuchen Sie es erneut.
es: No pudimos cargar tus claves en este momento. Por favor inténtalo de nuevo.
fr: Nous n'avons pas pu charger vos clés pour le moment. Veuillez réessayer.
hi: हम अभी आपकी चाबियाँ लोड नहीं कर सके. कृपया पुन: प्रयास करें।
ja: 現在キーをロードできませんでした。もう一度試してください。
ko: 지금은 키를 로드할 수 없습니다. 다시 시도해 주세요.
pt_br: Não foi possível carregar suas chaves agora. Por favor, tente novamente.
ru: Мы не смогли загрузить ваши ключи прямо сейчас. Пожалуйста, попробуйте еще раз.
zh_hans: 暂时无法加载密钥，请重试。

# key_type_ecc_curve25519
source: ECC (Curve25519)
ar: إي سي سي (منحنى 25519)
de: ECC (Kurve25519)
es: ECC (Curva25519)
fr: ECC (Courbe25519)
hi: ईसीसी (वक्र25519)
ja: ECC (曲線25519)
ko: ECC(곡선25519)
pt_br: ECC (Curva25519)
ru: ЕСС (кривая25519)

# key_type_ecc_description
source: Modern and efficient, smaller key size with same security
ar: مفتاح حديث وفعال وأصغر حجمًا وبنفس الأمان
de: Modern und effizient, kleinere Schlüsselgröße bei gleicher Sicherheit
es: Moderno y eficiente, tamaño de clave más pequeño con la misma seguridad
fr: Moderne et efficace, taille de clé plus petite avec la même sécurité
hi: आधुनिक और कुशल, समान सुरक्षा के साथ छोटी कुंजी का आकार
ja: 最新かつ効率的で、同じセキュリティを備えたより小さなキー サイズ
ko: 동일한 보안을 유지하면서 현대적이고 효율적이며 더 작은 키 크기
pt_br: Moderno e eficiente, tamanho de chave menor com a mesma segurança
ru: Современный и эффективный, ключ меньшего размера с той же безопасностью
zh_hans: 现代高效，更小的密钥尺寸但同等安全性

# key_type_private
source: Private Key
ar: مفتاح خاص
de: Privater Schlüssel
es: Clave privada
fr: Clé privée
hi: निजी चाबी
ja: 秘密鍵
ko: 개인 키
pt_br: Chave privada
ru: Закрытый ключ
zh_hans: 私钥

# key_type_public
source: Public Key
ar: المفتاح العام
de: Öffentlicher Schlüssel
es: Clave pública
fr: Clé publique
hi: सार्वजनिक कुंजी
ja: 公開鍵
ko: 공개 키
pt_br: Chave Pública
ru: Открытый ключ
zh_hans: 公钥

# key_type_rsa_description
source: Most widely compatible, recommended for most users
ar: الأكثر توافقًا على نطاق واسع، موصى به لمعظم المستخدمين
de: Am weitesten kompatibel, für die meisten Benutzer empfohlen
es: Más ampliamente compatible, recomendado para la mayoría de los usuarios.
fr: Le plus largement compatible, recommandé pour la plupart des utilisateurs
hi: सर्वाधिक व्यापक रूप से संगत, अधिकांश उपयोगकर्ताओं के लिए अनुशंसित
ja: 最も幅広い互換性があり、ほとんどのユーザーに推奨されます
ko: 가장 널리 호환되며 대부분의 사용자에게 권장됩니다.
pt_br: Mais amplamente compatível, recomendado para a maioria dos usuários
ru: Наиболее широко совместим, рекомендуется для большинства пользователей.
zh_hans: 兼容性最广，推荐大多数用户使用

# key_type_rsa2048
source: RSA-2048
ar: آر إس إيه-2048
hi: आरएसए-2048
ru: РСА-2048

# key_type_rsa2048_description
source: Faster than RSA-4096, still secure for most use cases
ar: أسرع من RSA-4096، ولا يزال آمنًا لمعظم حالات الاستخدام
de: Schneller als RSA-4096, dennoch sicher für die meisten Anwendungsfälle
es: Más rápido que RSA-4096, aún seguro para la mayoría de los casos de uso
fr: Plus rapide que RSA-4096, toujours sécurisé pour la plupart des cas d'utilisation
hi: RSA-4096 से तेज़, अधिकांश उपयोग के मामलों के लिए अभी भी सुरक्षित है
ja: RSA-4096 よりも高速で、ほとんどのユースケースで安全です
ko: RSA-4096보다 빠르지만 대부분의 사용 사례에서 여전히 안전합니다.
pt_br: Mais rápido que o RSA-4096, ainda seguro para a maioria dos casos de uso
ru: Быстрее, чем RSA-4096, но по-прежнему безопасно для большинства случаев использования.
zh_hans: 比 RSA-4096 更快，对大多数用例仍然安全

# key_type_rsa4096
source: RSA-4096
ar: آر إس إيه-4096
hi: आरएसए-4096

# key_type_yubikey_stub
source: YubiKey Stub
ar: يوبيكي كعب
es: Talón de YubiKey
fr: Talon YubiKey
hi: यूबीकी स्टब
ja: YubiKey スタブ
ko: YubiKey 스텁
pt_br: Esboço do YubiKey
ru: YubiKey Заглушка
zh_hans: YubiKey 存根

# keyserver_label
source: Keyserver
ar: خادم المفاتيح
de: Schlüsselserver
es: servidor de claves
fr: Serveur de clés
hi: कुंजी सर्वर
ja: キーサーバー
ko: 키서버
pt_br: Servidor de chaves
ru: Сервер ключей
zh_hans: 密钥服务器

# keyserver_note
source: Your public key will be uploaded to the selected keyserver
ar: سيتم تحميل مفتاحك العام إلى خادم المفاتيح المحدد
de: Ihr öffentlicher Schlüssel wird auf den ausgewählten Schlüsselserver hochgeladen
es: Su clave pública se cargará en el servidor de claves seleccionado
fr: Votre clé publique sera téléchargée sur le serveur de clés sélectionné
hi: आपकी सार्वजनिक कुंजी चयनित कुंजीसर्वर पर अपलोड कर दी जाएगी
ja: 公開鍵は選択したキーサーバーにアップロードされます
ko: 공개 키가 선택한 키 서버에 업로드됩니다.
pt_br: Sua chave pública será carregada no servidor de chaves selecionado
ru: Ваш открытый ключ будет загружен на выбранный сервер ключей.
zh_hans: 您的公钥将上传到所选的密钥服务器

# label_capabilities
source: Capabilities
ar: القدرات
de: Fähigkeiten
es: Capacidades
fr: Capacités
hi: क्षमताओं
ja: 能力
ko: 기능
pt_br: Capacidades
ru: Возможности
zh_hans: 能力

# label_expires
source: Expires
ar: تنتهي
de: Läuft ab
es: Vence
fr: Expire
hi: समय-सीमा समाप्त
ja: 有効期限が切れます
ko: 만료
pt_br: Expira
ru: Срок действия истекает
zh_hans: 过期时间

# label_input
source: Input
ar: مدخل
de: Eingang
es: Aporte
fr: Saisir
hi: इनपुट
ja: 入力
ko: 입력
pt_br: Entrada
ru: Вход
zh_hans: 输入

# label_key_id
source: Key ID
ar: معرف المفتاح
de: Schlüssel-ID
es: ID de clave
fr: ID de clé
hi: कुंजी आईडी
ja: キーID
ko: 키 ID
pt_br: ID da chave
ru: Идентификатор ключа
zh_hans: 密钥 ID

# label_output
source: Output
ar: الإخراج
de: Ausgabe
es: Producción
fr: Sortir
hi: उत्पादन
ja: 出力
ko: 산출
pt_br: Saída
ru: Выход
zh_hans: 输出

# last_operation
source: Last operation: %1$@ at %2$@
ar: العملية الأخيرة: %1$@ في %2$@
de: Letzter Vorgang: %1$@ bei %2$@
es: Última operación: %1$@ en %2$@
fr: Dernière opération : %1$@ à %2$@
hi: अंतिम ऑपरेशन: %1$@ और %2$@
ja: 最終操作: %1$@ (%2$@)
ko: 마지막 작업: %1$@ (%2$@)
pt_br: Última operação: %1$@ em %2$@
ru: Последняя операция: %1$@ в %2$@.
zh_hans: 上次操作：%1$@ 于 %2$@

# main_window_title
source: Moaiy - An easy-to-use encrypt/decrypt tools
ar: Moaiy - أدوات تشفير/فك تشفير سهلة الاستخدام
de: Moaiy – Ein einfach zu verwendendes Verschlüsselungs-/Entschlüsselungstool
es: Moaiy: una herramienta de cifrado/descifrado fácil de usar
fr: Moaiy - Un outil de cryptage/déchiffrement facile à utiliser
hi: Moaiy - उपयोग में आसान एन्क्रिप्ट/डिक्रिप्ट टूल
ja: Moaiy - 使いやすい暗号化/復号化ツール
ko: Moaiy - 사용하기 쉬운 암호화/복호화 도구
pt_br: Moaiy - Uma ferramenta de criptografia/descriptografia fácil de usar
ru: Moaiy — простой в использовании инструмент шифрования/дешифрования.
zh_hans: Moaiy - 易用的加密/解密工具

# message_key_expired_description
source: This key has expired and can no longer be used for encryption
ar: انتهت صلاحية هذا المفتاح ولم يعد من الممكن استخدامه للتشفير
de: Dieser Schlüssel ist abgelaufen und kann nicht mehr zur Verschlüsselung verwendet werden
es: Esta clave ha caducado y ya no se puede utilizar para cifrar
fr: Cette clé a expiré et ne peut plus être utilisée pour le cryptage
hi: यह कुंजी समाप्त हो गई है और अब एन्क्रिप्शन के लिए इसका उपयोग नहीं किया जा सकता है
ja: このキーは有効期限が切れているため、暗号化には使用できません
ko: 이 키는 만료되어 더 이상 암호화에 사용할 수 없습니다.
pt_br: Esta chave expirou e não pode mais ser usada para criptografia
ru: Срок действия этого ключа истек, и его больше нельзя использовать для шифрования.
zh_hans: 此密钥已过期，无法继续用于加密

# migration_keyring_in_progress
source: Importing existing keys...
ar: جارٍ استيراد المفاتيح الموجودة...
de: Vorhandene Schlüssel werden importiert...
es: Importando claves existentes...
fr: Importation de clés existantes...
hi: मौजूदा कुंजियाँ आयात की जा रही हैं...
ja: 既存のキーをインポートしています...
ko: 기존 키를 가져오는 중...
pt_br: Importando chaves existentes...
ru: Импорт существующих ключей...
zh_hans: 正在导入已有密钥...

# migration_keyring_picker_message
source: Select your existing GnuPG home folder (usually ~/.gnupg)
ar: حدد مجلد GnuPG الرئيسي الموجود لديك (عادة ~/.gnupg)
de: Wählen Sie Ihren bestehenden GnuPG-Home-Ordner (normalerweise ~/.gnupg)
es: Seleccione su carpeta de inicio GnuPG existente (generalmente ~/.gnupg)
fr: Sélectionnez votre dossier personnel GnuPG existant (généralement ~/.gnupg)
hi: अपना मौजूदा GnuPG होम फ़ोल्डर चुनें (आमतौर पर ~/.gnupg)
ja: 既存の GnuPG ホーム フォルダー (通常は ~/.gnupg) を選択します。
ko: 기존 GnuPG 홈 폴더(보통 ~/.gnupg)를 선택하세요.
pt_br: Selecione sua pasta inicial do GnuPG existente (geralmente ~/.gnupg)
ru: Выберите существующую домашнюю папку GnuPG (обычно ~/.gnupg).
zh_hans: 请选择已有的 GnuPG 主目录（通常为 ~/.gnupg）

# migration_secret_keys_incomplete_warning
source: Some secret keys were not imported. Retry import and verify key availability.
ar: لم يتم استيراد بعض المفاتيح السرية. أعد محاولة الاستيراد وتحقق من توفر المفتاح.
de: Einige geheime Schlüssel wurden nicht importiert. Versuchen Sie den Import erneut und überprüfen Sie die Schlüsselverfügbarkeit.
es: Algunas claves secretas no se importaron. Vuelva a intentar importar y verifique la disponibilidad de claves.
fr: Certaines clés secrètes n'ont pas été importées. Réessayez l'importation et vérifiez la disponibilité de la clé.
hi: कुछ गुप्त कुंजियाँ आयात नहीं की गईं. आयात का पुनः प्रयास करें और कुंजी उपलब्धता सत्यापित करें।
ja: 一部の秘密キーがインポートされませんでした。インポートを再試行し、キーが利用可能であることを確認します。
ko: 일부 비밀 키를 가져오지 못했습니다. 가져오기를 다시 시도하고 키 가용성을 확인하세요.
pt_br: Algumas chaves secretas não foram importadas. Tente importar novamente e verifique a disponibilidade da chave.
ru: Некоторые секретные ключи не были импортированы. Повторите попытку импорта и проверьте доступность ключа.
zh_hans: 部分私钥未导入。请重试导入并确认密钥是否可用。

# migration_system_keyring_message
source: We found an existing GnuPG home on this Mac. You can import your existing keys into Moaiy's managed keyring.
ar: لقد عثرنا على منزل GnuPG موجود على جهاز Mac هذا. يمكنك استيراد مفاتيحك الحالية إلى حلقة المفاتيح المُدارة من Moaiy.
de: Wir haben auf diesem Mac ein vorhandenes GnuPG-Heim gefunden. Sie können Ihre vorhandenen Schlüssel in den verwalteten Schlüsselbund von Moaiy importieren.
es: Encontramos una casa GnuPG existente en esta Mac. Puede importar sus claves existentes al conjunto de claves administrado de Moaiy.
fr: Nous avons trouvé une maison GnuPG existante sur ce Mac. Vous pouvez importer vos clés existantes dans le trousseau de clés géré de Moaiy.
hi: हमें इस Mac पर एक मौजूदा GnuPG होम मिला। आप अपनी मौजूदा चाबियाँ Moaiy की प्रबंधित कीरिंग में आयात कर सकते हैं।
ja: この Mac 上に既存の GnuPG ホームが見つかりました。既存のキーを Moaiy の管理対象キーリングにインポートできます。
ko: 이 Mac에서 기존 GnuPG 홈을 찾았습니다. 기존 키를 Moaiy의 관리형 키링으로 가져올 수 있습니다.
pt_br: Encontramos uma página inicial do GnuPG existente neste Mac. Você pode importar suas chaves existentes para o chaveiro gerenciado do Moaiy.
ru: Мы нашли существующий дом GnuPG на этом Mac. Вы можете импортировать существующие ключи в управляемую связку ключей Moaiy.
zh_hans: 检测到此 Mac 存在已有 GnuPG 目录。您可以将现有密钥导入到 Moaiy 管理的密钥库。

# migration_system_keyring_title
source: Import Existing Keys?
ar: هل تريد استيراد المفاتيح الموجودة؟
de: Vorhandene Schlüssel importieren?
es: ¿Importar claves existentes?
fr: Importer des clés existantes ?
hi: मौजूदा कुंजियाँ आयात करें?
ja: 既存のキーをインポートしますか?
ko: 기존 키를 가져오시겠습니까?
pt_br: Importar chaves existentes?
ru: Импортировать существующие ключи?
zh_hans: 导入已有密钥？

# mode_decrypt
source: Decrypt
ar: فك التشفير
de: Entschlüsseln
es: Descifrar
fr: Décrypter
hi: डिक्रिप्ट
ja: 復号化
ko: 암호 해독
pt_br: Descriptografar
ru: Расшифровать
zh_hans: 解密

# mode_encrypt
source: Encrypt
ar: تشفير
de: Verschlüsseln
es: cifrar
fr: Chiffrer
hi: एन्क्रिप्ट
ja: 暗号化する
ko: 암호화
pt_br: Criptografar
ru: Шифровать
zh_hans: 加密

# naming_custom
source: Custom
ar: مخصص
de: Brauch
es: Costumbre
fr: Coutume
hi: रिवाज़
ja: カスタム
ko: 관습
pt_br: Personalizado
ru: Обычай
zh_hans: 自定义

# naming_filename_asc
source: filename.asc
ar: اسم الملف.asc
de: Dateiname.asc
es: nombre de archivo.asc
fr: nom de fichier.asc
hi: फ़ाइल नाम.asc
ja: ファイル名.asc
ko: 파일명.asc
pt_br: nome do arquivo.asc
ru: имя_файла.asc
zh_hans: 文件名.asc

# naming_filename_gpg
source: filename.gpg
ar: اسم الملف.gpg
de: Dateiname.gpg
es: nombre de archivo.gpg
fr: nom de fichier.gpg
hi: फ़ाइल नाम.gpg
ja: ファイル名.gpg
ko: 파일명.gpg
pt_br: nome do arquivo.gpg
ru: имя_файла.gpg
zh_hans: 文件名.gpg

# no_keys_available
source: No keys available. Please import or create keys first.
ar: لا توجد مفاتيح متاحة. الرجاء استيراد المفاتيح أو إنشائها أولاً.
de: Keine Schlüssel vorhanden. Bitte importieren oder erstellen Sie zuerst Schlüssel.
es: No hay llaves disponibles. Primero importe o cree claves.
fr: Aucune clé disponible. Veuillez d'abord importer ou créer des clés.
hi: कोई चाबियाँ उपलब्ध नहीं. कृपया पहले कुंजियाँ आयात करें या बनाएँ।
ja: 利用可能なキーがありません。最初にキーをインポートまたは作成してください。
ko: 사용 가능한 열쇠가 없습니다. 먼저 키를 가져오거나 생성하세요.
pt_br: Nenhuma chave disponível. Importe ou crie chaves primeiro.
ru: Ключей нет. Сначала импортируйте или создайте ключи.
zh_hans: 没有可用密钥。请先导入或创建密钥。

# no_keys_match_search
source: No keys match your search
ar: لا توجد مفاتيح تطابق بحثك
de: Zu Ihrer Suche passen keine Schlüssel
es: Ninguna clave coincide con tu búsqueda
fr: Aucune clé ne correspond à votre recherche
hi: कोई भी कुंजी आपकी खोज से मेल नहीं खाती
ja: 検索に一致するキーはありません
ko: 검색어와 일치하는 키가 없습니다.
pt_br: Nenhuma chave corresponde à sua pesquisa
ru: Нет ключей, соответствующих вашему запросу
zh_hans: 没有找到匹配的密钥

# notification_expired_keys_body
source: You have %lld expired keys. Please review them in Moaiy.
ar: لديك مفاتيح %lld منتهية الصلاحية. يرجى مراجعتها في Moaiy.
de: Sie haben %lld abgelaufene Schlüssel. Bitte überprüfen Sie sie in Moaiy.
es: Tienes claves caducadas %lld. Por favor revísalos en Moaiy.
fr: Vous disposez de clés %lld expirées. Veuillez les consulter dans Moaiy.
hi: आपके पास %lld की समय सीमा समाप्त हो गई है। कृपया Moaiy में उनकी समीक्षा करें।
ja: %lld の有効期限が切れたキーがあります。 Moaiyでレビューしてください。
ko: %lld 만료된 키가 있습니다. 모아이에서 검토해 보세요.
pt_br: Você tem chaves expiradas %lld. Por favor, revise-os em Moaiy.
ru: У вас есть ключи с истекшим сроком действия %lld. Пожалуйста, просмотрите их в Moaiy.
zh_hans: 您有 %lld 个密钥已过期。请在 Moaiy 中查看。

# notification_expired_keys_title
source: Keys Expired
ar: المفاتيح منتهية الصلاحية
de: Schlüssel abgelaufen
es: Claves caducadas
fr: Clés expirées
hi: कुंजियाँ समाप्त हो गईं
ja: キーの有効期限が切れました
ko: 키가 만료되었습니다
pt_br: Chaves expiradas
ru: Срок действия ключей истек
zh_hans: 密钥已过期
